solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_LCDIF.h
#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_RED_MASK   (0xFF0000U)
#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_RED_SHIFT  (16U)
/*! RED - Red */
#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_RED(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCOLORKEYHIGH_RED_SHIFT)) & LCDIF_FRAMEBUFFERCOLORKEYHIGH_RED_MASK)

#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_ALPHA_MASK (0xFF000000U)
#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_ALPHA_SHIFT (24U)
/*! ALPHA - Alpha */
#define LCDIF_FRAMEBUFFERCOLORKEYHIGH_ALPHA(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCOLORKEYHIGH_ALPHA_SHIFT)) & LCDIF_FRAMEBUFFERCOLORKEYHIGH_ALPHA_MASK)
/*! @} */

/*! @name FRAMEBUFFERCLEARVALUE - Frame Buffer Clear Value */
/*! @{ */

#define LCDIF_FRAMEBUFFERCLEARVALUE_BLUE_MASK    (0xFFU)
#define LCDIF_FRAMEBUFFERCLEARVALUE_BLUE_SHIFT   (0U)
/*! BLUE - Blue */
#define LCDIF_FRAMEBUFFERCLEARVALUE_BLUE(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCLEARVALUE_BLUE_SHIFT)) & LCDIF_FRAMEBUFFERCLEARVALUE_BLUE_MASK)

#define LCDIF_FRAMEBUFFERCLEARVALUE_GREEN_MASK   (0xFF00U)
#define LCDIF_FRAMEBUFFERCLEARVALUE_GREEN_SHIFT  (8U)
/*! GREEN - Green */
#define LCDIF_FRAMEBUFFERCLEARVALUE_GREEN(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCLEARVALUE_GREEN_SHIFT)) & LCDIF_FRAMEBUFFERCLEARVALUE_GREEN_MASK)

#define LCDIF_FRAMEBUFFERCLEARVALUE_RED_MASK     (0xFF0000U)
#define LCDIF_FRAMEBUFFERCLEARVALUE_RED_SHIFT    (16U)
/*! RED - Red */
#define LCDIF_FRAMEBUFFERCLEARVALUE_RED(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCLEARVALUE_RED_SHIFT)) & LCDIF_FRAMEBUFFERCLEARVALUE_RED_MASK)

#define LCDIF_FRAMEBUFFERCLEARVALUE_ALPHA_MASK   (0xFF000000U)
#define LCDIF_FRAMEBUFFERCLEARVALUE_ALPHA_SHIFT  (24U)
/*! ALPHA - Alpha */
#define LCDIF_FRAMEBUFFERCLEARVALUE_ALPHA(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCLEARVALUE_ALPHA_SHIFT)) & LCDIF_FRAMEBUFFERCLEARVALUE_ALPHA_MASK)
/*! @} */

/*! @name VIDEOTL - Video Top Left Coordinate */
/*! @{ */

#define LCDIF_VIDEOTL_X_MASK                     (0xFFFU)
#define LCDIF_VIDEOTL_X_SHIFT                    (0U)
/*! X - Left Boundary */
#define LCDIF_VIDEOTL_X(x)                       (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOTL_X_SHIFT)) & LCDIF_VIDEOTL_X_MASK)

#define LCDIF_VIDEOTL_Y_MASK                     (0xFFF0000U)
#define LCDIF_VIDEOTL_Y_SHIFT                    (16U)
/*! Y - Top Boundary */
#define LCDIF_VIDEOTL_Y(x)                       (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOTL_Y_SHIFT)) & LCDIF_VIDEOTL_Y_MASK)
/*! @} */

/*! @name FRAMEBUFFERSIZE - Frame Buffer Size */
/*! @{ */

#define LCDIF_FRAMEBUFFERSIZE_WIDTH_MASK         (0xFFFU)
#define LCDIF_FRAMEBUFFERSIZE_WIDTH_SHIFT        (0U)
/*! WIDTH - Video Width */
#define LCDIF_FRAMEBUFFERSIZE_WIDTH(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERSIZE_WIDTH_SHIFT)) & LCDIF_FRAMEBUFFERSIZE_WIDTH_MASK)

#define LCDIF_FRAMEBUFFERSIZE_HEIGHT_MASK        (0xFFF0000U)
#define LCDIF_FRAMEBUFFERSIZE_HEIGHT_SHIFT       (16U)
/*! HEIGHT - Video Height */
#define LCDIF_FRAMEBUFFERSIZE_HEIGHT(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERSIZE_HEIGHT_SHIFT)) & LCDIF_FRAMEBUFFERSIZE_HEIGHT_MASK)
/*! @} */

/*! @name VIDEOGLOBALALPHA - Video Global Alpha */
/*! @{ */

#define LCDIF_VIDEOGLOBALALPHA_SRC_ALPHA_MASK    (0xFFU)
#define LCDIF_VIDEOGLOBALALPHA_SRC_ALPHA_SHIFT   (0U)
/*! SRC_ALPHA - Source Alpha */
#define LCDIF_VIDEOGLOBALALPHA_SRC_ALPHA(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOGLOBALALPHA_SRC_ALPHA_SHIFT)) & LCDIF_VIDEOGLOBALALPHA_SRC_ALPHA_MASK)

#define LCDIF_VIDEOGLOBALALPHA_DST_ALPHA_MASK    (0xFF00U)
#define LCDIF_VIDEOGLOBALALPHA_DST_ALPHA_SHIFT   (8U)
/*! DST_ALPHA - Destination Alpha */
#define LCDIF_VIDEOGLOBALALPHA_DST_ALPHA(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOGLOBALALPHA_DST_ALPHA_SHIFT)) & LCDIF_VIDEOGLOBALALPHA_DST_ALPHA_MASK)
/*! @} */

/*! @name BLENDSTACKORDER - Blend Stack Order */
/*! @{ */

#define LCDIF_BLENDSTACKORDER_ORDER_MASK         (0x7U)
#define LCDIF_BLENDSTACKORDER_ORDER_SHIFT        (0U)
/*! ORDER - Stack Order
 *  0b000..In the order of VG, Overlay 0 and Overlay 1 layers.
 *  0b001..In the order of VG, Overlay 1 and Overlay 0 layers.
 *  0b010..In the order of Overlay 0, VG and Overlay 1 layers.
 *  0b011..In the order of Overlay 0, Overlay 1, and VG layers.
 *  0b100..In the order of Overlay 1, VG and Overlay 0 layers.
 *  0b101..In the order of Overlay 1, Overlay 0, and VG layers.
 */
#define LCDIF_BLENDSTACKORDER_ORDER(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_BLENDSTACKORDER_ORDER_SHIFT)) & LCDIF_BLENDSTACKORDER_ORDER_MASK)
/*! @} */

/*! @name VIDEOALPHABLENDCONFIG - Alpha Blending Configuration */
/*! @{ */

#define LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK (0x1U)
#define LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_SHIFT (0U)
/*! ALPHA_BLEND - Alpha Blending
 *  0b0..Disables alpha blending for video.
 *  0b1..Enables alpha blending for video.
 */
#define LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_SHIFT)) & LCDIF_VIDEOALPHABLENDCONFIG_ALPHA_BLEND_MASK)

#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_MODE_MASK (0x2U)
#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_MODE_SHIFT (1U)
/*! SRC_ALPHA_MODE - Source Alpha Mode
 *  0b0..Normal source alpha mode
 *  0b1..Inversed alpha mode if the internal alpha rule needs to be followed
 */
#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_MODE_SHIFT)) & LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_MODE_MASK)

#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_MASK (0x18U)
#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_SHIFT (3U)
/*! SRC_GLOBAL_ALPHA_MODE - Source Global Alpha Mode
 *  0b00..Normal source alpha mode
 *  0b01..Global source alpha mode
 *  0b10..Scaled (by the global alpha value) source alpha mode
 */
#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_SHIFT)) & LCDIF_VIDEOALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_MASK)

