solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_LCDIF.h
#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE_MASK (0xC0U)
#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE_SHIFT (6U)
/*! SRC_BLENDING_MODE - Source Blending Mode
 *  0b00..Each component of the color is multiplied by (0, 0, 0,0).
 *  0b01..Each component of the color is multiplied by (1, 1, 1,1).
 *  0b10..Normal as the result color is the source color
 *  0b11..Not affected by the color of the underlying pixel
 */
#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE_SHIFT)) & LCDIF_VIDEOALPHABLENDCONFIG_SRC_BLENDING_MODE_MASK)

#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_FACTOR_MASK (0x100U)
#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_FACTOR_SHIFT (8U)
/*! SRC_ALPHA_FACTOR - Source Alpha Factor
 *  0b0..Do not generate the blending factor.
 *  0b1..Generates the blending factor.
 */
#define LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_FACTOR(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_FACTOR_SHIFT)) & LCDIF_VIDEOALPHABLENDCONFIG_SRC_ALPHA_FACTOR_MASK)

#define LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_MODE_MASK (0x200U)
#define LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_MODE_SHIFT (9U)
/*! DST_ALPHA_MODE - Destination Alpha Mode
 *  0b0..Normal destination alpha mode
 *  0b1..Inversed alpha mode if the internal alpha rule needs to be followed
 */
#define LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_MODE_SHIFT)) & LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_MODE_MASK)

#define LCDIF_VIDEOALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_MASK (0xC00U)
#define LCDIF_VIDEOALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_SHIFT (10U)
/*! DST_GLOBAL_ALPHA_MODE - Destination Global Alpha Mode
 *  0b00..Normal destination alpha mode
 *  0b01..Global destination alpha mode
 *  0b10..Scaled (by the global alpha value) destination alpha mode
 */
#define LCDIF_VIDEOALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_SHIFT)) & LCDIF_VIDEOALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_MASK)

#define LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE_MASK (0x6000U)
#define LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE_SHIFT (13U)
/*! DST_BLENDING_MODE - Destination Alpha Blending Mode
 *  0b00..Each component of the color is multiplied by (0, 0, 0,0).
 *  0b01..Each component of the color is multiplied by (1, 1, 1,1).
 *  0b10..Normal as the result color is the destination color
 *  0b11..Not affected by the color of the underlying pixel
 */
#define LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE_SHIFT)) & LCDIF_VIDEOALPHABLENDCONFIG_DST_BLENDING_MODE_MASK)

#define LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_FACTOR_MASK (0x8000U)
#define LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_FACTOR_SHIFT (15U)
/*! DST_ALPHA_FACTOR - Destination Alpha Factor
 *  0b0..Do not generate the blending factor for destination alpha.
 *  0b1..Generates the blending factor for destination alpha.
 */
#define LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_FACTOR(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_FACTOR_SHIFT)) & LCDIF_VIDEOALPHABLENDCONFIG_DST_ALPHA_FACTOR_MASK)
/*! @} */

/*! @name OVERLAYCONFIG - Overlay Configuration */
/*! @{ */

#define LCDIF_OVERLAYCONFIG_FORMAT_MASK          (0x7U)
#define LCDIF_OVERLAYCONFIG_FORMAT_SHIFT         (0U)
/*! FORMAT - Overlay Format
 *  0b000..No overlay
 *  0b001..Overlay format is A4R4G4B4.
 *  0b010..Overlay format is A1R5G5B5.
 *  0b011..Overlay format is R5G6B5.
 *  0b100..Overlay format is A8R8G8B8.
 *  0b101..Overlay format is A8R5G6B5.
 */
#define LCDIF_OVERLAYCONFIG_FORMAT(x)            (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG_FORMAT_SHIFT)) & LCDIF_OVERLAYCONFIG_FORMAT_MASK)

#define LCDIF_OVERLAYCONFIG_ENABLE_MASK          (0x8U)
#define LCDIF_OVERLAYCONFIG_ENABLE_SHIFT         (3U)
/*! ENABLE - Enable
 *  0b0..Disables this overlay layer.
 *  0b1..Enables this overlay layer.
 */
#define LCDIF_OVERLAYCONFIG_ENABLE(x)            (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG_ENABLE_SHIFT)) & LCDIF_OVERLAYCONFIG_ENABLE_MASK)

#define LCDIF_OVERLAYCONFIG_CLEAR_EN_MASK        (0x20U)
#define LCDIF_OVERLAYCONFIG_CLEAR_EN_SHIFT       (5U)
/*! CLEAR_EN - Clear
 *  0b0..Disables clearing the overlay layer.
 *  0b1..Enables clearing the overlay layer.
 */
#define LCDIF_OVERLAYCONFIG_CLEAR_EN(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG_CLEAR_EN_SHIFT)) & LCDIF_OVERLAYCONFIG_CLEAR_EN_MASK)

#define LCDIF_OVERLAYCONFIG_SWIZZLE_MASK         (0x60000U)
#define LCDIF_OVERLAYCONFIG_SWIZZLE_SHIFT        (17U)
/*! SWIZZLE - RGB Swizzle
 *  0b00..Input pixel in ARGB format
 *  0b01..Input pixel in RGBA format
 *  0b10..Input pixel in ABGR format
 *  0b11..Input pixel in BGRA format
 */
#define LCDIF_OVERLAYCONFIG_SWIZZLE(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG_SWIZZLE_SHIFT)) & LCDIF_OVERLAYCONFIG_SWIZZLE_MASK)

#define LCDIF_OVERLAYCONFIG_UV_SWIZZLE_MASK      (0x80000U)
#define LCDIF_OVERLAYCONFIG_UV_SWIZZLE_SHIFT     (19U)
/*! UV_SWIZZLE - UV Swizzle */
#define LCDIF_OVERLAYCONFIG_UV_SWIZZLE(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG_UV_SWIZZLE_SHIFT)) & LCDIF_OVERLAYCONFIG_UV_SWIZZLE_MASK)

#define LCDIF_OVERLAYCONFIG_COLOR_KEY_EN_MASK    (0x100000U)
#define LCDIF_OVERLAYCONFIG_COLOR_KEY_EN_SHIFT   (20U)
/*! COLOR_KEY_EN - Color Keying
 *  0b0..Disables color keying.
 *  0b1..Enables color keying.
 */
#define LCDIF_OVERLAYCONFIG_COLOR_KEY_EN(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG_COLOR_KEY_EN_SHIFT)) & LCDIF_OVERLAYCONFIG_COLOR_KEY_EN_MASK)

#define LCDIF_OVERLAYCONFIG_DEC_MODE_MASK        (0xE00000U)
#define LCDIF_OVERLAYCONFIG_DEC_MODE_SHIFT       (21U)
/*! DEC_MODE - Decompression Mode
 *  0b000..Disables decompression.
 *  0b001..Non Subsample
 *  0b010..Horizontal Subsample
 *  0b011..Horizontal Vertical Subsample
 *  0b100..ETC2
 */
#define LCDIF_OVERLAYCONFIG_DEC_MODE(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG_DEC_MODE_SHIFT)) & LCDIF_OVERLAYCONFIG_DEC_MODE_MASK)

