solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_LCDIF.h
#define LCDIF_OVERLAYCONFIG_ROT_ANGLE_MASK       (0x7000000U)
#define LCDIF_OVERLAYCONFIG_ROT_ANGLE_SHIFT      (24U)
/*! ROT_ANGLE - Rotation Angle
 *  0b000..Sets the rotation angle to 0 degree.
 *  0b010..Sets the rotation angle to 180 degree.
 *  0b100..Flips horizontal
 *  0b101..Flips vertical
 */
#define LCDIF_OVERLAYCONFIG_ROT_ANGLE(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG_ROT_ANGLE_SHIFT)) & LCDIF_OVERLAYCONFIG_ROT_ANGLE_MASK)
/*! @} */

/*! @name OVERLAYADDRESS - Overlay Address */
/*! @{ */

#define LCDIF_OVERLAYADDRESS_ADDRESS_MASK        (0xFFFFFFFFU)
#define LCDIF_OVERLAYADDRESS_ADDRESS_SHIFT       (0U)
/*! ADDRESS - Starting Address */
#define LCDIF_OVERLAYADDRESS_ADDRESS(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYADDRESS_ADDRESS_SHIFT)) & LCDIF_OVERLAYADDRESS_ADDRESS_MASK)
/*! @} */

/*! @name OVERLAYSTRIDE - Overlay Stride */
/*! @{ */

#define LCDIF_OVERLAYSTRIDE_STRIDE_MASK          (0x1FFFFU)
#define LCDIF_OVERLAYSTRIDE_STRIDE_SHIFT         (0U)
/*! STRIDE - Stride */
#define LCDIF_OVERLAYSTRIDE_STRIDE(x)            (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYSTRIDE_STRIDE_SHIFT)) & LCDIF_OVERLAYSTRIDE_STRIDE_MASK)
/*! @} */

/*! @name DCOVERLAYTILEINCFG - Tile Input Configuration */
/*! @{ */

#define LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT_MASK (0x3U)
#define LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT_SHIFT (0U)
/*! TILE_FORMAT - Tile Input Format
 *  0b00..No tile input. See DcOverlayTileInCfg[TILE_FORMAT1].
 *  0b01..Sets the tile input format to ARGB8888.
 *  0b10..Sets the tile input format to YUY2.
 *  0b11..Sets the tile input format to NV12.
 */
#define LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT(x)  (((uint32_t)(((uint32_t)(x)) << LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT_SHIFT)) & LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT_MASK)

#define LCDIF_DCOVERLAYTILEINCFG_YUV_STANDARD_MASK (0x4U)
#define LCDIF_DCOVERLAYTILEINCFG_YUV_STANDARD_SHIFT (2U)
/*! YUV_STANDARD - YUV Standard
 *  0b0..Selects the YUV standard BT601.
 *  0b1..Selects the YUV standard BT709.
 */
#define LCDIF_DCOVERLAYTILEINCFG_YUV_STANDARD(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_DCOVERLAYTILEINCFG_YUV_STANDARD_SHIFT)) & LCDIF_DCOVERLAYTILEINCFG_YUV_STANDARD_MASK)

#define LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT1_MASK (0x18U)
#define LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT1_SHIFT (3U)
/*! TILE_FORMAT1 - Tile Format 1 */
#define LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT1(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT1_SHIFT)) & LCDIF_DCOVERLAYTILEINCFG_TILE_FORMAT1_MASK)
/*! @} */

/*! @name DCTILEUVOVERLAYADR - Tile Uv Overlay Address */
/*! @{ */

#define LCDIF_DCTILEUVOVERLAYADR_ADDRESS_MASK    (0xFFFFFFFFU)
#define LCDIF_DCTILEUVOVERLAYADR_ADDRESS_SHIFT   (0U)
/*! ADDRESS - Starting Overlay Address */
#define LCDIF_DCTILEUVOVERLAYADR_ADDRESS(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_DCTILEUVOVERLAYADR_ADDRESS_SHIFT)) & LCDIF_DCTILEUVOVERLAYADR_ADDRESS_MASK)
/*! @} */

/*! @name DCTILEUVOVERLAYSTR - Tile Uv Overlay Stride */
/*! @{ */

#define LCDIF_DCTILEUVOVERLAYSTR_STRIDE_MASK     (0xFFFFU)
#define LCDIF_DCTILEUVOVERLAYSTR_STRIDE_SHIFT    (0U)
/*! STRIDE - Overlay Stride */
#define LCDIF_DCTILEUVOVERLAYSTR_STRIDE(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_DCTILEUVOVERLAYSTR_STRIDE_SHIFT)) & LCDIF_DCTILEUVOVERLAYSTR_STRIDE_MASK)
/*! @} */

/*! @name OVERLAYTL - Overlay Top Left */
/*! @{ */

#define LCDIF_OVERLAYTL_X_MASK                   (0xFFFU)
#define LCDIF_OVERLAYTL_X_SHIFT                  (0U)
/*! X - Left Boundary */
#define LCDIF_OVERLAYTL_X(x)                     (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYTL_X_SHIFT)) & LCDIF_OVERLAYTL_X_MASK)

#define LCDIF_OVERLAYTL_Y_MASK                   (0xFFF0000U)
#define LCDIF_OVERLAYTL_Y_SHIFT                  (16U)
/*! Y - Top Boundary */
#define LCDIF_OVERLAYTL_Y(x)                     (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYTL_Y_SHIFT)) & LCDIF_OVERLAYTL_Y_MASK)
/*! @} */

/*! @name OVERLAYSIZE - Overlay Size */
/*! @{ */

#define LCDIF_OVERLAYSIZE_WIDTH_MASK             (0xFFFU)
#define LCDIF_OVERLAYSIZE_WIDTH_SHIFT            (0U)
/*! WIDTH - Width */
#define LCDIF_OVERLAYSIZE_WIDTH(x)               (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYSIZE_WIDTH_SHIFT)) & LCDIF_OVERLAYSIZE_WIDTH_MASK)

#define LCDIF_OVERLAYSIZE_HEIGHT_MASK            (0xFFF0000U)
#define LCDIF_OVERLAYSIZE_HEIGHT_SHIFT           (16U)
/*! HEIGHT - Height */
#define LCDIF_OVERLAYSIZE_HEIGHT(x)              (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYSIZE_HEIGHT_SHIFT)) & LCDIF_OVERLAYSIZE_HEIGHT_MASK)
/*! @} */

/*! @name OVERLAYCOLORKEY - Overlay Color Keying Start Address */
/*! @{ */

#define LCDIF_OVERLAYCOLORKEY_BLUE_MASK          (0xFFU)
#define LCDIF_OVERLAYCOLORKEY_BLUE_SHIFT         (0U)
/*! BLUE - Blue */
#define LCDIF_OVERLAYCOLORKEY_BLUE(x)            (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEY_BLUE_SHIFT)) & LCDIF_OVERLAYCOLORKEY_BLUE_MASK)

#define LCDIF_OVERLAYCOLORKEY_GREEN_MASK         (0xFF00U)
#define LCDIF_OVERLAYCOLORKEY_GREEN_SHIFT        (8U)
/*! GREEN - Green */
#define LCDIF_OVERLAYCOLORKEY_GREEN(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEY_GREEN_SHIFT)) & LCDIF_OVERLAYCOLORKEY_GREEN_MASK)

#define LCDIF_OVERLAYCOLORKEY_RED_MASK           (0xFF0000U)
#define LCDIF_OVERLAYCOLORKEY_RED_SHIFT          (16U)
/*! RED - Red */
#define LCDIF_OVERLAYCOLORKEY_RED(x)             (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEY_RED_SHIFT)) & LCDIF_OVERLAYCOLORKEY_RED_MASK)

#define LCDIF_OVERLAYCOLORKEY_ALPHA_MASK         (0xFF000000U)
#define LCDIF_OVERLAYCOLORKEY_ALPHA_SHIFT        (24U)
/*! ALPHA - Alpha */
#define LCDIF_OVERLAYCOLORKEY_ALPHA(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEY_ALPHA_SHIFT)) & LCDIF_OVERLAYCOLORKEY_ALPHA_MASK)
/*! @} */

/*! @name OVERLAYCOLORKEYHIGH - Overlay Color Keying End Address */
/*! @{ */

#define LCDIF_OVERLAYCOLORKEYHIGH_BLUE_MASK      (0xFFU)
#define LCDIF_OVERLAYCOLORKEYHIGH_BLUE_SHIFT     (0U)
/*! BLUE - Blue */
#define LCDIF_OVERLAYCOLORKEYHIGH_BLUE(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEYHIGH_BLUE_SHIFT)) & LCDIF_OVERLAYCOLORKEYHIGH_BLUE_MASK)

#define LCDIF_OVERLAYCOLORKEYHIGH_GREEN_MASK     (0xFF00U)
#define LCDIF_OVERLAYCOLORKEYHIGH_GREEN_SHIFT    (8U)
/*! GREEN - Green */
#define LCDIF_OVERLAYCOLORKEYHIGH_GREEN(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEYHIGH_GREEN_SHIFT)) & LCDIF_OVERLAYCOLORKEYHIGH_GREEN_MASK)

#define LCDIF_OVERLAYCOLORKEYHIGH_RED_MASK       (0xFF0000U)
#define LCDIF_OVERLAYCOLORKEYHIGH_RED_SHIFT      (16U)
/*! RED - Red */
#define LCDIF_OVERLAYCOLORKEYHIGH_RED(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEYHIGH_RED_SHIFT)) & LCDIF_OVERLAYCOLORKEYHIGH_RED_MASK)

#define LCDIF_OVERLAYCOLORKEYHIGH_ALPHA_MASK     (0xFF000000U)
#define LCDIF_OVERLAYCOLORKEYHIGH_ALPHA_SHIFT    (24U)
/*! ALPHA - Alpha */
#define LCDIF_OVERLAYCOLORKEYHIGH_ALPHA(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEYHIGH_ALPHA_SHIFT)) & LCDIF_OVERLAYCOLORKEYHIGH_ALPHA_MASK)
/*! @} */

/*! @name OVERLAYALPHABLENDCONFIG - Overlay Alpha Blending Configuration */
/*! @{ */

#define LCDIF_OVERLAYALPHABLENDCONFIG_ALPHA_BLEND_MASK (0x1U)
#define LCDIF_OVERLAYALPHABLENDCONFIG_ALPHA_BLEND_SHIFT (0U)
/*! ALPHA_BLEND - Alpha Blend
 *  0b0..Disables alpha blending for overlay.
 *  0b1..Enables alpha blending for overlay.
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG_ALPHA_BLEND(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG_ALPHA_BLEND_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG_ALPHA_BLEND_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_MODE_MASK (0x2U)
#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_MODE_SHIFT (1U)
/*! SRC_ALPHA_MODE - Source Alpha Mode
 *  0b0..Normal alpha mode
 *  0b1..Inversed alpha mode if the internal alpha rule needs to be followed
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_MASK (0x18U)
#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_SHIFT (3U)
/*! SRC_GLOBAL_ALPHA_MODE - Source Global Alpha Mode
 *  0b00..Normal source alpha mode
 *  0b01..Global source alpha mode
 *  0b10..Scaled (by the global alpha value) source alpha mode
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG_SRC_GLOBAL_ALPHA_MODE_MASK)

