solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_LCDIF.h
#define LCDIF_DCCONTROL_RAM_CLOCK_GATING_MASK    (0x10U)
#define LCDIF_DCCONTROL_RAM_CLOCK_GATING_SHIFT   (4U)
/*! RAM_CLOCK_GATING - Enables or disables RAM clock gating.
 *  0b0..Disables RAM clock gating.
 *  0b1..Enables RAM clock gating.
 */
#define LCDIF_DCCONTROL_RAM_CLOCK_GATING(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_DCCONTROL_RAM_CLOCK_GATING_SHIFT)) & LCDIF_DCCONTROL_RAM_CLOCK_GATING_MASK)
/*! @} */

/*! @name LAYERCLOCKGATE - Layer Clock Gating */
/*! @{ */

#define LCDIF_LAYERCLOCKGATE_DISABLE_VIDEO_CLK_MASK (0x1U)
#define LCDIF_LAYERCLOCKGATE_DISABLE_VIDEO_CLK_SHIFT (0U)
/*! DISABLE_VIDEO_CLK - Disable Video Clock
 *  0b0..Disables clock gating on the VG layer.
 *  0b1..Enables clock gating on the VG layer.
 */
#define LCDIF_LAYERCLOCKGATE_DISABLE_VIDEO_CLK(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_LAYERCLOCKGATE_DISABLE_VIDEO_CLK_SHIFT)) & LCDIF_LAYERCLOCKGATE_DISABLE_VIDEO_CLK_MASK)

#define LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY0_CLK_MASK (0x2U)
#define LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY0_CLK_SHIFT (1U)
/*! DISABLE_OVERLAY0_CLK - Disable Overlay 0 Clock
 *  0b0..Disables clock gating on the overlay 0 layer.
 *  0b1..Enables clock gating on the overlay 0 layer.
 */
#define LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY0_CLK(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY0_CLK_SHIFT)) & LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY0_CLK_MASK)

#define LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY1_CLK_MASK (0x4U)
#define LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY1_CLK_SHIFT (2U)
/*! DISABLE_OVERLAY1_CLK - Disable Overlay 1 Clock
 *  0b0..Disables clock gating on the overlay 1 layer.
 *  0b1..Enables clock gating on the overlay 1 layer.
 */
#define LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY1_CLK(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY1_CLK_SHIFT)) & LCDIF_LAYERCLOCKGATE_DISABLE_OVERLAY1_CLK_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group LCDIF_Register_Masks */


/*!
 * @}
 */ /* end of group LCDIF_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* LCDIF_H_ */

